In [106]:
import pandas as pd 
import re 
import string

In [107]:
def clean_text(text):
    # Convert the text to lowercase
    text = text.lower()
    # Remove all non-alphanumeric characters and white spaces using regular expression
    text = re.sub(r'[^\w\s]', '', text)
    # Remove all digits using regular expression
    text = re.sub(r'\d+', '', text)
    # Strip leading and trailing white spaces
    text = text.strip()
    # Return the cleaned text
    return text



def count_tools(data_science_libraries,text):
    text =  clean_text(text).split()
    common = set(data_science_libraries) & set(text)  
    return len(common)   

stop_words = [ "a", "an", "and", "are", "as", "at", "be", "by", "for", "from", "has", "he",    "in", "is", "it", "its", "of", "on", "that", "the", "to", "was", "were",    "will", "with"]

data_science_libraries = ['numpy', 'pandas', 'matplotlib', 'seaborn', 'scipy', 'scikit-learn', 'tensorflow', 'keras', 'pytorch', 'xgboost', 'lightgbm', 'catboost', 'statsmodels', 'nltk', 'spacy', 'gensim', 'opencv', 'cvxpy', 'pillow', 'pyautogui', 'bokeh', 'plotly', 'altair', 'folium', 'geopandas', 'gdal', 'shapely', 'descartes', 'pymc3', 'arviz', 'theano', 'keras-rl', 'openai gym', 'baselines', 'ray', 'rapids', 'dask', 'joblib', 'luigi', 'airflow', 'pyspark', 'h2o', 'shap', 'eli5', 'lime', 'yellowbrick', 'eli5', 'tensorboard', 'tensorflow profiler', 'tflearn', 'keras-tuner', 'autokeras', 'hyperopt', 'optuna', 'ray tune', 'scikit-optimize', 'bayesianoptimization', 'hyperas', 'talos', 'fastai', 'pyro', 'edward', 'pyro', 'pymc4', 'zipline', 'backtrader', 'ta', 'pandas_datareader', 'yfinance', 'quandl', 'fredapi', 'ccxt', 'iexfinance', 'alpha_vantage', 'alphalens', 'pyfolio', 'empyrical', 'backtesting', 'tushare', 'easyquotation', 'jqdatasdk', 'yfinance', 'mlfinlab', 'pmdarima', 'prophet', 'fbprophet', 'tsfresh', 'tsrepr', 'statsmodels', 'prophet', 'cufflinks', 'plotly_express', 'folium', 'geoviews', 'hvplot', 'datashader', 'holoviews', 'bqplot', 'geoplotlib', 'glueviz', 'pandas_profiling', 'sweetviz', 'missingno', 'dabl', 'mlxtend', 'imbalanced-learn', 'xgboost']

In [2]:
cvs_path = '/workspaces/predictive_maintenance/data/other/UpdatedResumeDataSet.csv'

In [108]:
df = pd.read_csv(cvs_path, encoding='utf-8')

In [109]:
df.shape

(962, 2)

In [110]:
df.head()

       Category                                             Resume
0  Data Science  Skills * Programming Languages: Python (pandas...
1  Data Science  Education Details \r\nMay 2013 to May 2017 B.E...
2  Data Science  Areas of Interest Deep Learning, Control Syste...
3  Data Science  Skills â¢ R â¢ Python â¢ SAP HANA â¢ Table...
4  Data Science  Education Details \r\n MCA   YMCAUST,  Faridab...

In [111]:
df.value_counts('Category').to_frame().head()

                   0
Category
Java Developer    84
Testing           70
DevOps Engineer   55
Python Developer  48
Web Designing     45

In [112]:
df.columns

Index(['Category', 'Resume'], dtype='object')

In [113]:
df['char_count'] = df['Resume'].apply(lambda x: len(x))
df['word_count'] = df['Resume'].apply(lambda x: len(x.split(' ')))
df

,Category,Resume,char_count,word_count
0,Data Science,Skills * Programming Languages: Python (pandas...,4786,643
1,Data Science,Education Details \r\nMay 2013 to May 2017 B.E...,1268,200
2,Data Science,"Areas of Interest Deep Learning, Control Syste...",1871,262
3,Data Science,Skills â¢ R â¢ Python â¢ SAP HANA â¢ Table...,6995,888
4,Data Science,"Education Details \r\n MCA YMCAUST, Faridab...",452,68
...,...,...,...,...
957,Testing,Computer Skills: â¢ Proficient in MS office (...,2130,303
958,Testing,â Willingness to accept the challenges. â ...,2306,301
959,Testing,"PERSONAL SKILLS â¢ Quick learner, â¢ Eagerne...",3319,520
960,Testing,COMPUTER SKILLS & SOFTWARE KNOWLEDGE MS-Power ...,767,103
961,Testing,Skill Set OS Windows XP/7/8/8.1/10 Database MY...,1955,365

In [115]:
data_science_libraries = [w.lower() for w  in data_science_libraries]    

df['tools_count'] = df['Resume'].apply(lambda x: count_tools(data_science_libraries,x)) 
df[(df['tools_count']!=0) & (df['Category']=='Data Science') ]

,Category,Resume,char_count,word_count,tools_count
0,Data Science,Skills * Programming Languages: Python (pandas...,4786,643,7
1,Data Science,Education Details \r\nMay 2013 to May 2017 B.E...,1268,200,4
7,Data Science,Education Details \r\n B.Tech Rayat and Bahr...,8192,1032,7
8,Data Science,Personal Skills â¢ Ability to quickly grasp t...,1778,230,3
9,Data Science,Expertise â Data and Quantitative Analysis â...,4381,666,1
10,Data Science,Skills * Programming Languages: Python (pandas...,4786,643,7
11,Data Science,Education Details \r\nMay 2013 to May 2017 B.E...,1268,200,4
17,Data Science,Education Details \r\n B.Tech Rayat and Bahr...,8192,1032,7
18,Data Science,Personal Skills â¢ Ability to quickly grasp t...,1778,230,3
19,Data Science,Expertise â Data and Quantitative Analysis â...,4381,666,1
20,Data Science,Skills * Programming Languages: Python (pandas...,4786,643,7
21,Data Science,Education Details \r\nMay 2013 to May 2017 B.E...,1268,200,4
27,Data Science,Education Details \r\n B.Tech Rayat and Bahr...,8192,1032,7
28,Data Science,Personal Skills â¢ Ability to quickly grasp t...,1778,230,3
29,Data Science,Expertise â Data and Quantitative Analysis â...,4381,666,1
30,Data Science,Skills * Programming Languages: Python (pandas...,4786,643,7
31,Data Science,Education Details \r\nMay 2013 to May 2017 B.E...,1268,200,4
37,Data Science,Education Details \r\n B.Tech Rayat and Bahr...,8192,1032,7
38,Data Science,Personal Skills â¢ Ability to quickly grasp t...,1778,230,3
39,Data Science,Expertise â Data and Quantitative Analysis â...,4381,666,1

In [90]:
sample_cv = df['Resume'].loc[0]

In [92]:

word_count = dict()

for row in df.iterrows():
    if row[1]['Category'] == 'Data Science':
        
        cv_words = clean_text(row[1]['Resume']).split()
        #print (cv_words)
        for word in cv_words:
            if word in stop_words:
                continue
            if len(word) < 3:
                continue
            if word in word_count:
                word_count[word] += 1
            else:
                word_count[word] = 1

In [93]:
word_count
pd.DataFrame(word_count.items(), columns=['word', 'count']).sort_values('count', ascending=False).head(50)

            word  count
73          data    392
310          ãââ    316
82     exprience    248
83        months    240
13      learning    200
3         python    180
74       science    168
185         year    168
336         than    160
335         less    156
12       machine    148
72       details    120
100    analytics    120
831         ãââª    108
281        using     96
705         like     88
26      analysis     84
86       company     76
513      project     72
293          can     72
341     business     72
70          deep     72
87   description     72
485          sap     68
115         this     64
725    knowledge     64
9            sql     60
141         text     56
475         have     56
109     platform     56
0         skills     56
649   experience     52
538     industry     52
139  information     52
135  development     52
495          nlp     52
394    technical     52
514     involved     48
54       tableau     48
486         hana     48
675   algorithms     48
40        neural     48
435  engineering     48
137       models     44
151    developed     44
431      january     44
537  environment     44
80         skill     40
529          key     40
443       school     40

## Concat, Merge

In [134]:
import os 
from os import path, listdir 
from os.path import isfile, join

In [136]:
data_dir = '/workspaces/predictive_maintenance/data/raw'

list_of_files = [f for f in listdir(data_dir) if isfile(join(data_dir, f))]
parquet_files = [join(data_dir,f)  for f in list_of_files if f.endswith('.parquet')]
parquet_files

df1 = pd.read_parquet(parquet_files[0])

['/workspaces/predictive_maintenance/data/raw/PdM_failures.parquet',
 '/workspaces/predictive_maintenance/data/raw/PdM_machines.parquet',
 '/workspaces/predictive_maintenance/data/raw/PdM_telemetry2.parquet',
 '/workspaces/predictive_maintenance/data/raw/PdM_errors.parquet',
 '/workspaces/predictive_maintenance/data/raw/PdM_maint.parquet',
 '/workspaces/predictive_maintenance/data/raw/PdM_telemetry.parquet']

In [137]:
files_mapping = {}
for f in parquet_files:
    name = f.split('/')[-1].split('.')[0]
    files_mapping[name] = f

files_mapping

{'PdM_failures': '/workspaces/predictive_maintenance/data/raw/PdM_failures.parquet',
 'PdM_machines': '/workspaces/predictive_maintenance/data/raw/PdM_machines.parquet',
 'PdM_telemetry2': '/workspaces/predictive_maintenance/data/raw/PdM_telemetry2.parquet',
 'PdM_errors': '/workspaces/predictive_maintenance/data/raw/PdM_errors.parquet',
 'PdM_maint': '/workspaces/predictive_maintenance/data/raw/PdM_maint.parquet',
 'PdM_telemetry': '/workspaces/predictive_maintenance/data/raw/PdM_telemetry.parquet'}

In [138]:
PdM_failures = pd.read_parquet(files_mapping['PdM_failures'])
PdM_machines = pd.read_parquet(files_mapping['PdM_machines'])



display (PdM_failures.head())
display (PdM_machines.head())

              datetime  machineID failure
0  2015-01-05 06:00:00          1   comp4
1  2015-03-06 06:00:00          1   comp1
2  2015-04-20 06:00:00          1   comp2
3  2015-06-19 06:00:00          1   comp4
4  2015-09-02 06:00:00          1   comp4

   machineID   model  age
0          1  model3   18
1          2  model4    7
2          3  model3    8
3          4  model3    7
4          5  model3    2

In [129]:
pd.merge(PdM_failures, PdM_machines, on='machineID', how='left')

                datetime  machineID failure   model  age
0    2015-01-05 06:00:00          1   comp4  model3   18
1    2015-03-06 06:00:00          1   comp1  model3   18
2    2015-04-20 06:00:00          1   comp2  model3   18
3    2015-06-19 06:00:00          1   comp4  model3   18
4    2015-09-02 06:00:00          1   comp4  model3   18
..                   ...        ...     ...     ...  ...
756  2015-11-29 06:00:00         99   comp3  model1   14
757  2015-12-14 06:00:00         99   comp4  model1   14
758  2015-02-12 06:00:00        100   comp1  model4    5
759  2015-09-10 06:00:00        100   comp1  model4    5
760  2015-12-09 06:00:00        100   comp2  model4    5

[761 rows x 5 columns]